In [5]:
import pandas as pd

In [6]:
"hello"

'hello'

In [9]:
dataframe = pd.DataFrame()
dataframe

Empty DataFrame
Columns: []
Index: []

In [10]:
# Dictionary
data = {
    'Name': ['Alice', 'Bob', 'Chandni', 'Dawood'],
    'Age': [25, 30, 18, 22],
    'City': ['Mumbai', 'Kolkata', 'Delhi', 'Bengaluru']
}

dataset = pd.DataFrame(data)

In [11]:
dataset

      Name  Age       City
0    Alice   25     Mumbai
1      Bob   30    Kolkata
2  Chandni   18      Delhi
3   Dawood   22  Bengaluru

In [13]:
dataset.dtypes
# String is an object

Name    object
Age      int64
City    object
dtype: object

In [14]:
dataset.ndim

2

In [15]:
dataset.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
dataset.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [17]:
names = pd.Series(['Alice', 'Bob', 'Chandni', 'Dawood'])
ages = pd.Series([25, 30, 18, 22])
cities = pd.Series(['Mumbai', 'Kolkata', 'Delhi', 'Bengaluru'])

df2 = pd.DataFrame({'Name': names, 'Age': ages, 'City': cities})

In [20]:
df3 = pd.DataFrame([names, ages, cities],["Name","Age", "City"])
df3

           0        1        2          3
Name   Alice      Bob  Chandni     Dawood
Age       25       30       18         22
City  Mumbai  Kolkata    Delhi  Bengaluru

In [ ]:
'''
.head() => default 5 top rows
.tail() => bottom 5 rows
.descibe() => mean, medial mode, and more analytics data, if any one column in int, 
you will get mean, median mode kind of data otherwise it would have string specific funtion
'''

In [ ]:
"""
df.loc[
    (df['target_runs'] >= 200) & (df['result_margin'] <= 10),
    ['date', 'team1', 'team2', 'target_runs', 'result_margin']
]

returnoing only specified columns awhen conditions atisfied
"""

In [23]:
"""
NUMPY
Questions:

"""
import numpy as np

In [80]:
"""
Q1. Create a 1D NumPy array of salaries

Create a 2D array with shape (5, 2)

Create an array of zeros, ones, and a full array

Create an array using arange and linspace
"""

salaries = np.array([5000,4000,23555, 243523,57545], dtype=float)
print(salaries)
print("\n")

ndarray = np.array([[5,2],[25,12], [45,12], [65,87],[33,47]])
print(ndarray)
print("\n")

ndzero = np.zeros([3,5],dtype = int)
print(ndzero)
print("\n")

# Full array : Fill array with one contsnat value
ndfull = np.full((3,2),76, dtype=int)
print(ndfull)
print("\n")


ndone = np.ones([2,3], dtype = int)
print(ndone)
print("\n")

ndarange = np.arange(9).reshape([3,3])
print(ndarange)
print("\n")

# Generate 10 numbers between 0 and 5
ndlinespace = np.linspace(1,5,num = 10)
print(ndlinespace)
print("\n")

[  5000.   4000.  23555. 243523.  57545.]


[[ 5  2]
 [25 12]
 [45 12]
 [65 87]
 [33 47]]


[[0 0 0 0 0]
 [0 0 0 0 0]
 [0 0 0 0 0]]


[[76 76]
 [76 76]
 [76 76]]


[[1 1 1]
 [1 1 1]]


[[0 1 2]
 [3 4 5]
 [6 7 8]]


[1.         1.44444444 1.88888889 2.33333333 2.77777778 3.22222222
 3.66666667 4.11111111 4.55555556 5.        ]

In [81]:
"""
Q2.
Extract first 3 elements

Extract last 2 elements

Reverse the array

Slice alternate elements
"""

print(salaries[:3])
print("\n")

print(salaries[-2:])
print("\n")

print(salaries[::-1])
print("\n")

print(salaries[::2]) #step [start:end:step]
print("\n")

[ 5000.  4000. 23555.]


[243523.  57545.]


[ 57545. 243523.  23555.   4000.   5000.]


[ 5000. 23555. 57545.]

In [75]:
"""

Q3

Reshape a 1D array to (2, n)

Flatten using:

ravel()

flatten()

=> Modify flattened array and check:

Does original change?

Which returns a view?

"""

v
nreshape = ndarray.reshape([2,5])
print(nreshape)
print("\n")

nflatten = nreshape.flatten() # flatten  always returns a COPY

New memory is allocated
print(nflatten)
print("\n")

nravel = nreshape.ravel()  # ravel() returns a VIEW whenever possible
print(nravel)
print("\n")

[[ 1  2  3  4  5]
 [ 6  7  8  9 10]]


[ 1  2  3  4  5  6  7  8  9 10]


[ 1  2  3  4  5  6  7  8  9 10]

In [83]:
"""
Q4. 
Add 10% increment to all salaries

Subtract mean salary from each value

Divide array by max value
"""

salariesInc = salaries + (salaries * 0.10)
print(salariesInc)
print("\n")

subMean = salaries - salaries.mean()
print(subMean)
print("\n")


salariesDiv = salaries / salaries.max()
print(salariesDiv)
print("\n")

[  5500.    4400.   25910.5 267875.3  63299.5]


[-61724.6 -62724.6 -43169.6 176798.4  -9179.6]


[0.02053194 0.01642555 0.09672598 1.         0.23630212]

In [94]:
"""
Q5

Find salaries > 10L

Replace salaries < 8L with 8L

Count how many satisfy a condition
"""

newsalaries = np.array([200000,1300000,3000000,400,200])
print(newsalaries[newsalaries > 1000000])
print("\n")

newsalaries[newsalaries < 800000] = 800000 # fill value does not exist in numpy
print(newsalaries)

print(np.sum(newsalaries > 1000000)) # count satisfying condition ******

[1300000 3000000]


[ 800000 1300000 3000000  800000  800000]
2

In [97]:
import pandas as pd

In [105]:
"""
Q6

Create a Series from list

Create a Series from NumPy array

Create a Series with emp_id as index

"""

list1 = [2,4,7,1]
seriesTest = pd.Series(list1)
print(seriesTest)
print("\n")

newsalaries = np.array([200000,1300000,3000000,400,200])
seriesTest2 = pd.Series(newsalaries)
print(seriesTest2)
print("\n")

employeeList = [{"name" : "John", "emp_id" : "e001"}, {"name" : "Christine", "emp_id" : "e002"}, {"name" : "Martin", "emp_id" : "e003"}]
index = [emp["emp_id"] for emp in employeeList]   # *************
seriesTest3 = pd.Series(employeeList, index = index)
print(seriesTest3)
print("\n")

print(type(seriesTest3.index))

0    2
1    4
2    7
3    1
dtype: int64


0     200000
1    1300000
2    3000000
3        400
4        200
dtype: int64


e001         {'name': 'John', 'emp_id': 'e001'}
e002    {'name': 'Christine', 'emp_id': 'e002'}
e003       {'name': 'Martin', 'emp_id': 'e003'}
dtype: object


<class 'pandas.core.indexes.base.Index'>

In [114]:
"""
Q7

Access by label

Access by position

Slice by index range

ðŸ“Œ Modify sliced Series â†’
âž¡ï¸ Does original Series change?

"""

employeeList = [{"name" : "John", "emp_id" : "e001"}, {"name" : "Christine", "emp_id" : "e002"}, {"name" : "Martin", "emp_id" : "e003"}]
index = [emp["emp_id"] for emp in employeeList]
data = [emp["name"] for emp in employeeList]
newList  = pd.Series(data,index)
print(newList)
print("\n")
print(newList.loc["e002"])
print("\n")

print(newList.iloc[1])
print("\n")

print(newList.iloc[1:])
print("\n")

print(newList.loc[:"e002"])
print("\n")
print(newList.iloc[::2])

# Modifying a sliced Series can affect the original, so .copy() should be used to be safe.

e001         John
e002    Christine
e003       Martin
dtype: object


Christine


Christine


e002    Christine
e003       Martin
dtype: object


e001         John
e002    Christine
dtype: object


e001      John
e003    Martin
dtype: object

In [121]:
"""
Q8

Arithmetic operations between two Series

Series + scalar

Series alignment by index

"""

# A.
s1 = pd.Series([100, 200, 300], index=["e1", "e2", "e3"])
s2 = pd.Series([10, 20, 30], index=["e2", "e3", "e4"])

s3 = s1.add(s2)
print(s3)
print("\n")

s4 = s1.add(s2).fillna(0)
print(s4)
print("\n")

# s1.fillna(0)  # fillna() does NOT modify in place by default s1 and s2 are unchanged
# s2.fillna(0)  # use fill_value
# s5 = s1.add(s2)
# print(s5)
# print("\n")

 # use fill_value
s5 = s1.add(s2, fill_value = 0) # will fill 0 in all empty place forst and then add **************
print(s5)
print("\n")


# B.
s6 = s1 + 400
print(s6)
print("\n")


# C.
print(s3.sort_index())
print("\n")

e1      NaN
e2    210.0
e3    320.0
e4      NaN
dtype: float64


e1      0.0
e2    210.0
e3    320.0
e4      0.0
dtype: float64


e1    100.0
e2    210.0
e3    320.0
e4     30.0
dtype: float64


e1    500
e2    600
e3    700
dtype: int64


e1      NaN
e2    210.0
e3    320.0
e4      NaN
dtype: float64

In [129]:
"""
Q9

Use +, add()

Use fillna() vs fillna(inplace=True)

Use sort_values() and check return value

ðŸ” Key Question:
Which methods mutate and which return new Series?

"""
s1 = pd.Series([100, 200, 300], index=["e1", "e2", "e3"])
s2 = pd.Series([10, 20, 30], index=["e2", "e3", "e4"])
s1.fillna(0.0, inplace = True)  # inplace=True modifies the object and returns None.
s2.fillna(0.0, inplace = True)  # fillna() only fills existing NaNs.
s5 = s1.add(s2)
print(s5)
print("\n")


s2.sort_values()
print(s2)
print("\n")

e1      NaN
e2    210.0
e3    320.0
e4      NaN
dtype: float64


e2    10
e3    20
e4    30
dtype: int64

In [137]:
"""
Q10

Perform in one chain:

Filter salary > mean

Sort descending

Select top 3
"""

newsalaries = np.array([200000,1300000,3000000,400,200])
print("\n")
seriesTest2 = pd.Series(newsalaries)
print(seriesTest2)
print("\n")

print(seriesTest2[seriesTest2 > seriesTest2.mean()])
print("\n")

seriesTest2.sort_values(ascending = False) # Descending ******
print("\n")

seriesTest3 = pd.Series(newsalaries)
print(seriesTest3.head(3))




top3 = (
    seriesTest2
    [seriesTest2 > seriesTest2.mean()]
    .sort_values(ascending=False)
    .head(3)
)

print("\n")

print(top3)

0     200000
1    1300000
2    3000000
3        400
4        200
dtype: int64


1    1300000
2    3000000
dtype: int64




0     200000
1    1300000
2    3000000
dtype: int64
2    3000000
1    1300000
dtype: int64

In [139]:
"""
Dataframes
"""

emp = pd.read_csv("employees.csv")
print(emp)
print("\n")

   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   850000           4
4     105      Eva        Sales     Mumbai  2017-11-30   950000           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   800000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating
0     4.5
1     4.0
2     3.8
3     4.2
4     4.7
5     3.9
6     4.1
7     4.8
8     3.6
9     4.0

In [143]:
"""
Q11

Load CSV

Inspect using head, info, describe

Set emp_id as index
"""

print(emp.head(3))
print("\n")

print(emp.info())
print("\n")

print(emp.describe()) # even if one is int it will calculat mean median and all
print("\n")

empTest = emp.set_index("emp_id") # setting index in dataframe
print(empTest)
print("\n")


# # # Set emp_id as index
# emp.set_index("emp_id", inplace=True)

   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6

   rating
0     4.5
1     4.0
2     3.8


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_id      10 non-null     int64
 1   name        10 non-null     object
 2   dept        10 non-null     object
 3   location    10 non-null     object
 4   join_date   10 non-null     object
 5   salary      10 non-null     int64
 6   experience  10 non-null     int64
 7   rating      10 non-null     float64
dtypes: float64(1), int64(3), object(4)
memory usage: 772.0+ bytes
None


          emp_id        salary  experience     rating
count   10.00000  1.000000e+01   10.000000  10.000000
mean   105.50000  8.820000e+05    4.700000   4.160000
std      3.02765  2.331332e+05    1.888562   0.392145
min    101.00000  6.000000e+05    2.000000   3.600000
25%    103.25000  7.275000e+05    3.250000   3.925000
50%    105.50000  8.250000e+05    4.500000   4.050000
75%    107.75000  9.375000e+05    5.750000   4.425000
max    110.00000  1.350000e+06    8.000000   4.800000


           name         dept   location   join_date   salary  experience  \
emp_id
101       Alice  Engineering  Bangalore  2019-06-10  1200000           5
102         Bob  Engineering  Bangalore  2021-08-15   900000           3
103     Charlie           HR  Hyderabad  2018-03-20   700000           6
104       David        Sales     Mumbai  2020-01-05   850000           4
105         Eva        Sales     Mumbai  2017-11-30   950000           7
106       Frank    Marketing      Delhi  2022-04-12   600000           2
107       Grace    Marketing      Delhi  2019-09-25   750000           5
108      Hannah  Engineering       Pune  2016-02-18  1350000           8
109         Ian        Sales  Bangalore  2021-07-01   800000           3
110        Jane           HR       Pune  2020-12-10   720000           4

        rating
emp_id
101        4.5
102        4.0
103        3.8
104        4.2
105        4.7
106        3.9
107        4.1
108        4.8
109        3.6
110        4.0

In [153]:
"""
Q12

Select single column (Series vs DataFrame)

Select multiple columns

Row slicing using:

loc

iloc
"""

# emp["name"]          # Series
# emp[["name"]]        # DataFrame
# emp.loc[:, "name"]   # Series
# emp.loc[:, ["name"]] # DataFrame

print(emp.loc[:,["name"]])   # ***** imp
print("\n")

print(emp.loc[:,["name","location"]])   # ***** imp
print("\n")

print(emp.loc[:4,["name","location"]])   # ***** imp
print("\n")

print(emp.iloc[:4,:])   # ***** imp
print("\n")

      name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva
5    Frank
6    Grace
7   Hannah
8      Ian
9     Jane


      name   location
0    Alice  Bangalore
1      Bob  Bangalore
2  Charlie  Hyderabad
3    David     Mumbai
4      Eva     Mumbai
5    Frank      Delhi
6    Grace      Delhi
7   Hannah       Pune
8      Ian  Bangalore
9     Jane       Pune


      name   location
0    Alice  Bangalore
1      Bob  Bangalore
2  Charlie  Hyderabad
3    David     Mumbai
4      Eva     Mumbai


   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   850000           4

   rating
0     4.5
1     4.0
2     3.8
3     4.2

In [173]:
"""
C. Querying
Q13

Employees in Sales with rating > 4

Employees joined after 2020

Use query() instead of boolean indexing
"""

print(emp[(emp["dept"]=="Sales") & (emp["rating"] > 4)])   # ****** imp
print("\n")

print("\n")


print(emp[emp["join_date"] >= "2020-01-01" ])
print("\n")

print("\n")


print(emp.query("join_date >= '2020-01-01'"))   # using query no need to mention emp / dataframe
print("\n")

print("\n")
print(emp.query("(dept=='Sales') & (rating > 4)"))

   emp_id   name   dept location   join_date  salary  experience  rating
3     104  David  Sales   Mumbai  2020-01-05  850000           4     4.2
4     105    Eva  Sales   Mumbai  2017-11-30  950000           7     4.7




   emp_id   name         dept   location   join_date  salary  experience  \
1     102    Bob  Engineering  Bangalore  2021-08-15  900000           3
3     104  David        Sales     Mumbai  2020-01-05  850000           4
5     106  Frank    Marketing      Delhi  2022-04-12  600000           2
8     109    Ian        Sales  Bangalore  2021-07-01  800000           3
9     110   Jane           HR       Pune  2020-12-10  720000           4

   rating
1     4.0
3     4.2
5     3.9
8     3.6
9     4.0




   emp_id   name         dept   location   join_date  salary  experience  \
1     102    Bob  Engineering  Bangalore  2021-08-15  900000           3
3     104  David        Sales     Mumbai  2020-01-05  850000           4
5     106  Frank    Marketing      Delhi  2022-04-12  600000           2
8     109    Ian        Sales  Bangalore  2021-07-01  800000           3
9     110   Jane           HR       Pune  2020-12-10  720000           4

   rating
1     4.0
3     4.2
5     3.9
8     3.6
9     4.0




   emp_id   name   dept location   join_date  salary  experience  rating
3     104  David  Sales   Mumbai  2020-01-05  850000           4     4.2
4     105    Eva  Sales   Mumbai  2017-11-30  950000           7     4.7

In [177]:
#Dataframe

dtf = pd.DataFrame(
    {
  "emp_id" : ["em001","em002","em003"],
  "name" : ["john","matt","tresa"],
  "dept" : ["english","maths","finance"]
})
dtf= dtf.set_index("emp_id")
print(dtf)

         name     dept
emp_id
em001    john  english
em002    matt    maths
em003   tresa  finance

In [180]:
emp1 = {"name":"john", "emp_id":"em001","dept":"english","age":3}
emp2 = {"name":"matt", "emp_id":"em002","dept":"maths"}
emp3 = {"name":"tresa", "emp_id":"em003","dept":"finance"}

dtf = pd.DataFrame([emp1,emp2,emp3])
dtf= dtf.set_index("emp_id")
print(dtf)

         name     dept  age
emp_id
em001    john  english  3.0
em002    matt    maths  NaN
em003   tresa  finance  NaN

In [194]:
"""
---------------------------------------------------------- IMPORTANT ----------------------------------------------------------
Operations on DataFrame
Q14

Create new column salary_lakhs

Increase salary for Sales by 5%

Drop a column (with and without inplace)

ðŸ” Which operations mutate?
"""

emp = pd.read_csv("employees.csv")
print(emp)
print("\n")


emp["salary_lakhs"] = (emp["salary"] / 100000).astype(int).astype(str) + "L"  # convert int to string nd then ass L
print(emp)
print("\n")


emp.loc[emp["dept"] == "Sales", "salary"] *= 1.05
print(emp)
print("\n")

emp.loc[emp["dept"]=="Engineering", "name"]


dropped = emp.drop(columns=["salary_lakhs"])
print(dropped)
print("\n")
print("\n")
print("\n")
print("\n")


print("Before dropping ",emp)
print("\n")

emp.drop(columns=["salary_lakhs"], inplace = True)
print("After dropping ",emp)
print("\n")

   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   850000           4
4     105      Eva        Sales     Mumbai  2017-11-30   950000           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   800000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating
0     4.5
1     4.0
2     3.8
3     4.2
4     4.7
5     3.9
6     4.1
7     4.8
8     3.6
9     4.0


   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   850000           4
4     105      Eva        Sales     Mumbai  2017-11-30   950000           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   800000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating salary_lakhs
0     4.5          12L
1     4.0           9L
2     3.8           7L
3     4.2           8L
4     4.7           9L
5     3.9           6L
6     4.1           7L
7     4.8          13L
8     3.6           8L
9     4.0           7L


   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   892500           4
4     105      Eva        Sales     Mumbai  2017-11-30   997500           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   840000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating salary_lakhs
0     4.5          12L
1     4.0           9L
2     3.8           7L
3     4.2           8L
4     4.7           9L
5     3.9           6L
6     4.1           7L
7     4.8          13L
8     3.6           8L
9     4.0           7L


   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   892500           4
4     105      Eva        Sales     Mumbai  2017-11-30   997500           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   840000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating
0     4.5
1     4.0
2     3.8
3     4.2
4     4.7
5     3.9
6     4.1
7     4.8
8     3.6
9     4.0








Before dropping     emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   892500           4
4     105      Eva        Sales     Mumbai  2017-11-30   997500           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   840000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating salary_lakhs
0     4.5          12L
1     4.0           9L
2     3.8           7L
3     4.2           8L
4     4.7           9L
5     3.9           6L
6     4.1           7L
7     4.8          13L
8     3.6           8L
9     4.0           7L


After dropping     emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   892500           4
4     105      Eva        Sales     Mumbai  2017-11-30   997500           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   840000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating
0     4.5
1     4.0
2     3.8
3     4.2
4     4.7
5     3.9
6     4.1
7     4.8
8     3.6
9     4.0

In [ ]:
"""
.loc â†’ Label-based indexing (MOST USED)
General syntax
df.loc[row_labels_or_condition, column_labels]



Select rows by label
df.loc["e001"]
df.loc[["e001", "e003"]]


Select columns
df.loc[:, "salary"]          # Series
df.loc[:, ["name", "salary"]]  # DataFrame

Select rows + columns
df.loc["e001", "salary"]
df.loc[["e001", "e002"], ["name", "salary"]]

df.loc[df["dept"] == "Sales"]
df.loc[(df["dept"] == "Sales") & (df["rating"] > 4)]

CONDITIONAL UPDATE (MOST IMPORTANT USE CASE)
df.loc[df["dept"] == "Sales", "salary"] *= 1.05

.iloc â†’ Position-based indexing
General syntax
df.iloc[row_positions, column_positions]


Select rows + columns
df.iloc[0:3, 1:4]



---------------------------------------

Short answer (the rule of thumb)

Use .loc whenever rows are involved.
Use df["col"] / df[["col"]] when youâ€™re only selecting columns.

In [202]:
"""
Q15
df1 = df[df["dept"] == "Sales"]
df1["salary"] += 50000


Observe warning

Fix using .loc

Fix using .copy()
"""
# df1 = df[df["dept"] == "Sales"]
# df1["salary"] += 50000

emp1  = emp.loc[emp["dept"] == "Sales"] 
print(emp1)
print("\n")

# will creaty copy
emp2  = emp.loc[emp["dept"] == "Sales"].copy()
print(emp2)
print("\n")

emp1["salary"] += 5000
print("without copy emp:   -------> \n ",emp) # no change in emp means copy was created
print("\n")

emp2["salary"] += 5000
print("after copy is updated:   -------> \n ",emp)
print("\n")

   emp_id   name   dept   location   join_date  salary  experience  rating
3     104  David  Sales     Mumbai  2020-01-05  892500           4     4.2
4     105    Eva  Sales     Mumbai  2017-11-30  997500           7     4.7
8     109    Ian  Sales  Bangalore  2021-07-01  840000           3     3.6


   emp_id   name   dept   location   join_date  salary  experience  rating
3     104  David  Sales     Mumbai  2020-01-05  892500           4     4.2
4     105    Eva  Sales     Mumbai  2017-11-30  997500           7     4.7
8     109    Ian  Sales  Bangalore  2021-07-01  840000           3     3.6


without copy emp:   ------->
     emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   892500           4
4     105      Eva        Sales     Mumbai  2017-11-30   997500           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   840000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating
0     4.5
1     4.0
2     3.8
3     4.2
4     4.7
5     3.9
6     4.1
7     4.8
8     3.6
9     4.0


after copy is updated:   ------->
     emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   892500           4
4     105      Eva        Sales     Mumbai  2017-11-30   997500           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   840000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating
0     4.5
1     4.0
2     3.8
3     4.2
4     4.7
5     3.9
6     4.1
7     4.8
8     3.6
9     4.0

/var/folders/4k/567n_rrn7tdchkf86355f2lc0000gn/T/ipykernel_2685/608073.py:25: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp1["salary"] += 5000

In [205]:
"""

Merging / Joining
Q16

Inner join with departments.csv

Left join

Check rows before and after merge

"""

emp = pd.read_csv("employees.csv")
dep = pd.read_csv("departments.csv")

print("Before merge \n")
print(emp)
print("\n")
print(dep)
print("\n")

merged = pd.merge(emp,dep, on = "dept",how = "left")

print("After merge \n")
print(merged)
print("\n")

Before merge

   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   850000           4
4     105      Eva        Sales     Mumbai  2017-11-30   950000           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   800000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating
0     4.5
1     4.0
2     3.8
3     4.2
4     4.7
5     3.9
6     4.1
7     4.8
8     3.6
9     4.0


          dept  dept_budget  bonus_pct
0  Engineering     50000000         10
1        Sales     40000000         15
2           HR     20000000          8
3    Marketing     25000000         12


After merge

   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   850000           4
4     105      Eva        Sales     Mumbai  2017-11-30   950000           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   800000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating  dept_budget  bonus_pct
0     4.5     50000000         10
1     4.0     50000000         10
2     3.8     20000000          8
3     4.2     40000000         15
4     4.7     40000000         15
5     3.9     25000000         12
6     4.1     25000000         12
7     4.8     50000000         10
8     3.6     40000000         15
9     4.0     20000000          8

In [206]:
merged2 = pd.merge(dep,emp, on = "dept",how = "left")
print("After merge \n")
print(merged2)

After merge

          dept  dept_budget  bonus_pct  emp_id     name   location  \
0  Engineering     50000000         10     101    Alice  Bangalore
1  Engineering     50000000         10     102      Bob  Bangalore
2  Engineering     50000000         10     108   Hannah       Pune
3        Sales     40000000         15     104    David     Mumbai
4        Sales     40000000         15     105      Eva     Mumbai
5        Sales     40000000         15     109      Ian  Bangalore
6           HR     20000000          8     103  Charlie  Hyderabad
7           HR     20000000          8     110     Jane       Pune
8    Marketing     25000000         12     106    Frank      Delhi
9    Marketing     25000000         12     107    Grace      Delhi

    join_date   salary  experience  rating
0  2019-06-10  1200000           5     4.5
1  2021-08-15   900000           3     4.0
2  2016-02-18  1350000           8     4.8
3  2020-01-05   850000           4     4.2
4  2017-11-30   950000           7     4.7
5  2021-07-01   800000           3     3.6
6  2018-03-20   700000           6     3.8
7  2020-12-10   720000           4     4.0
8  2022-04-12   600000           2     3.9
9  2019-09-25   750000           5     4.1

In [207]:
inner_merged = pd.merge(emp, dep, on="dept", how="inner")
print(inner_merged)
print("\n")

   emp_id     name         dept   location   join_date   salary  experience  \
0     101    Alice  Engineering  Bangalore  2019-06-10  1200000           5
1     102      Bob  Engineering  Bangalore  2021-08-15   900000           3
2     103  Charlie           HR  Hyderabad  2018-03-20   700000           6
3     104    David        Sales     Mumbai  2020-01-05   850000           4
4     105      Eva        Sales     Mumbai  2017-11-30   950000           7
5     106    Frank    Marketing      Delhi  2022-04-12   600000           2
6     107    Grace    Marketing      Delhi  2019-09-25   750000           5
7     108   Hannah  Engineering       Pune  2016-02-18  1350000           8
8     109      Ian        Sales  Bangalore  2021-07-01   800000           3
9     110     Jane           HR       Pune  2020-12-10   720000           4

   rating  dept_budget  bonus_pct
0     4.5     50000000         10
1     4.0     50000000         10
2     3.8     20000000          8
3     4.2     40000000         15
4     4.7     40000000         15
5     3.9     25000000         12
6     4.1     25000000         12
7     4.8     50000000         10
8     3.6     40000000         15
9     4.0     20000000          8

In [ ]:
"""
INNER JOIN rule

Keeps only matching keys

Drops non-matching rows from both sides

ðŸ”¹ LEFT JOIN (keep all employees)
Meaning in simple words

â€œGive me ALL employees, and attach department info if available.â€
"""

In [ ]:
"""
Grouping & Aggregation
Q17

Avg salary per department

Max rating per location

Multiple aggregations using agg()
"""

In [ ]:
"""
Q18

Group by department and calculate:

mean salary

total experience

employee count
"""

In [ ]:
"""
Transform vs Aggregate
Q19

Subtract department mean salary from each employee

Add column salary_vs_dept_avg
"""

In [208]:
"""
Q20

Identify employees who:

Have rating > department average

Salary < department average

Experience > 3 years
"""

_IncompleteInputError: incomplete input (969763094.py, line 1)

In [ ]:
"""
Basic sorting

Create a NumPy array of salaries (unsorted)

Sort
"""

In [ ]:
"""
Sorting along axes

Create a 2D array (dept_id, salary)

Sort:
"""

In [ ]:
"""
QN3. Argsort (VERY IMPORTANT)

Use np.argsort() on salary array

Reorder employee names using sorted salary indices
"""

In [ ]:
"""
QN4. Conditional sorting

Sort only salaries > 8L

Keep others unchanged
"""

In [ ]:
"""
QS1. Sort values

Sort salary Series ascending

Sort descending

Store result in a new variable

ðŸ” Did original Series change?

QS2. Sort index

Sort Series by index

Reverse index order
"""

In [ ]:
"""
QS3. Chained sorting

In one chain:

Drop NaNs

Sort descending

Select top 5

ðŸ“Œ Production-quality readable code

QS4. Sorting with alignment

Sort one Series

Add it to another Series

Observe index alignment
"""

In [ ]:
"""
QD1. Sort by single column

Sort employees by salary

Ascending & descending

Store vs overwrite
"""

In [ ]:
"""
QD2. Sort by multiple columns

Sort by:

department (asc)

salary (desc)
"""

In [ ]:
"""
QD3. Sort by index

Set emp_id as index

Sort by index

Reset index
"""

In [ ]:
"""
QD5. Sorting with groupby

Sort employees within each department by salary

Output should maintain department grouping
"""

In [ ]:
"""
QD7. Sorting + transform

Subtract top salary of each department from every employee
"""

In [ ]:
"""
Q1. Detect duplicates

Check if there are duplicate rows in the DataFrame

Count how many duplicate rows exist
"""

In [ ]:
"""
Find duplicate employees based on:

emp_id

name + dept
"""

In [ ]:
"""
Drop duplicates

Drop full duplicate rows

Drop duplicates keeping:

first

last

ðŸ” Check:

Does drop_duplicates() mutate the DataFrame?
"""

In [ ]:
"""
Q4. Drop duplicates using subset

Remove duplicate employees per department

Keep only the highest paid employee per department
"""

In [ ]:
"""
Q5. Real-world thinking

HR data came from two systems. Employee names are duplicated but IDs are unique.

Which column should be used for deduplication?
"""

In [ ]:
"""
Q6. Row-wise concatenation 

Split employees into two DataFrames (first half, second half)

Concatenate them back
"""

In [ ]:
"""
Column-wise concatenation
Create a DataFrame with:

emp_id

bonus_amount

Concatenate with employee DataFrame
"""

In [ ]:
"""
Q8. Ignore index

Concatenate two DataFrames row-wise using:

default index

ignore_index=True
"""

In [ ]:
"""
. Inner vs outer concat

Concatenate two DataFrames with different columns

Compare:

join="inner"

join="outer"
"""

In [ ]:
"""
Concatenation and copy behavior

Modify a DataFrame after concatenation

Check if original DataFrame changes
"""

In [ ]:
"""
Axis in aggregation

Calculate total salary:

per column

per row
"""

In [ ]:
"""
Axis in apply

Apply a function:

row-wise

column-wise
"""

In [ ]:
"""
Drop:

a column

a row

Use both axis values
"""

In [ ]:
"""
Row count

Get total number of rows using:

len(df)

df.shape

df.index

ðŸ“Œ Which is safest in production?
"""

In [ ]:
"""
Row count after filtering

Count:

employees in Sales

employees with rating > 4
"""

In [ ]:
"""
value_counts

Count employees per department

Count locations sorted by frequency
"""

In [ ]:
"""
isin

Filter employees in:

Sales

Engineering
"""

In [ ]:
"""
between

Filter employees with salary between 8L and 12L
"""

In [ ]:
"""
reset_index

Reset index after filtering

Reset index and drop old ind
""""

In [ ]:
"""
astype

Convert salary to float

Convert dept to category
"""

In [ ]:
"""
Q21. unique vs nunique

Get unique departments

Count number of unique departments
"""

In [ ]:
"""
Global aggregation column

Add a column avg_company_salary that shows company-wide average salary for every employee.



Add column salary_diff_from_avg

salary âˆ’ avg_company_salary



Department average salary

Add a column dept_avg_salary showing average salary of employeeâ€™s department


Salary vs department average

Add column salary_vs_dept_avg

salary âˆ’ dept_avg_salary
"""